app/Controllers/Api/BizController.php

    public function show($slug = null)
    {
        if ($slug === false) {
            return $this->index();
        }
        if(is_numeric($slug)){
            $where =['id' => $slug];
        }
        else{$where =['slug' => $slug];}
        $biz = $this->biz
                    ->where(self::filter)
                    ->where($where)
                    ->first();
        if($biz){
            $response = [
                'status'    => 200,
                'error'     => false,
                'message'   => 'Biz Details & Menus',
                'data'      => [
                    'biz'  => $biz,
                    'state'    => $this->stateModel->find($biz->state_id),
---
SELECT *
FROM `states`
WHERE `states`.`id` = '25'

    private function getStates()
    {
        $states = [
            '' => '-- Set State --',
        ];

        foreach ($this->stateModel->findAll() as $state_) {
---
SELECT *
FROM `states`