app/Entities/OrderEntity.php

SELECT *
FROM `bizs`
WHERE `id` = '3'
AND `bizs`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getBiz()
    {
        $data_ = $this->biz
            ->where(['id' => $this->biz_id] )
            ->first();

SELECT `user_address`.*, `state_cities`.`city_name`, `states`.`state_name`
FROM `user_address`
LEFT JOIN `state_cities` ON `user_address`.`city_id` = `state_cities`.`id`
LEFT JOIN `states` ON `user_address`.`state_id` = `states`.`id`
WHERE `user_address`.`id` = '1'
 LIMIT 1
---
    public function getUserAddress()
    {
        $data_ = $this->userAddress
                    ->select('user_address.*, state_cities.city_name, states.state_name')
                    ->join('state_cities', 'user_address.city_id = state_cities.id', 'left')
                    ->join('states', 'user_address.state_id = states.id', 'left')
                    ->where('user_address.id', $this->user_address_id)
                    ->first();