app/Entities/UserEntity.php

SELECT `user_address`.*, `state_cities`.`city_name`, `states`.`state_name`, `states`.`code` as `state_code`
FROM `user_address`
LEFT JOIN `state_cities` ON `user_address`.`city_id` = `state_cities`.`id`
LEFT JOIN `states` ON `user_address`.`state_id` = `states`.`id`
WHERE `user_address`.`id` = '1'
---
    public function getAddress()
    {
        $data_ = $this->userAddress
                    ->select('user_address.*, state_cities.city_name, states.state_name, states.code as state_code')
                    ->join('state_cities', 'user_address.city_id = state_cities.id', 'left')
                    ->join('states', 'user_address.state_id = states.id', 'left')
                    ->where('user_address.id', $this->id)
                    ->findAll();

SELECT `orders`.*, `bizs`.`name` as `biz_name`, `bizs`.`slug` as `biz_slug`, `bizs`.`biz_type`
FROM `orders`
LEFT JOIN `bizs` ON `bizs`.`id` = `orders`.`biz_id`
WHERE `orders`.`user_id` = '1'
AND `orders`.`status` = 1
AND `orders`.`isdeleted` = 0
AND `orders`.`deleted_at` IS NULL
ORDER BY `id` ASC
---
    public function getAllOrders()
    {
        $data_ = [];
        $categories = $this->order->asArray()
                    ->select('orders.*, bizs.name as biz_name, bizs.slug as biz_slug, bizs.biz_type ')
                    ->join('bizs', 'bizs.id = orders.biz_id', 'left')
                    ->where(['orders.user_id' => $this->id, 'orders.status' => 1, 'orders.isdeleted' => 0])
                    ->orderBy('id ASC')
                    ->findAll();