app/Controllers/Web/Superadmin/BizController.php

SELECT *
FROM `states`
WHERE `states`.`id` = '32'
---
    public function overview($slug = null)
    {
        $biz = $this->biz->where(self::filter)->where('slug',$slug)->first();
                //->paginate(50);
        if($biz){

            $breadcrumb =   '<li class="breadcrumb-item"><span class="bullet bg-gray-200 w-5px h-2px"></span></li>
                                    <li class="breadcrumb-item text-muted"><a href="'.site_url('otfadmin/vendor').'" class="text-muted text-hover-primary">Vendors</a></li>
                            <li class="breadcrumb-item"><span class="bullet bg-gray-200 w-5px h-2px"></span></li>
                                    <li class="breadcrumb-item text-dark">'.$biz->name.'</li>';

            $this->data = [
                'encrypter'     => $this->encrypter,
                'title'         => "OTF Superadmin:- Vendors: ".$biz->name,
                'parentMenu'    => "vendors",
                'currentMenu'   => 'overview',
                'breadcrumb'    => $breadcrumb,
                'biz'           => $biz,
                'state'         => $this->stateModel->find($biz->state_id),