app/Models/DeliveryLocationsModel.php

    public function getDeliveryLocate(){
        $data   =   $this->select('delivery_locations.*, state_cities.city_name, states.state_name')
                        ->join('state_cities', 'delivery_locations.city_id = state_cities.id', 'left')
                        ->join('states', 'delivery_locations.state_id = states.id', 'left')
                        ->orderBy('state_name ASC, city_name ASC')
                        ->findAll();
---
SELECT `delivery_locations`.*, `state_cities`.`city_name`, `states`.`state_name`
FROM `delivery_locations`
LEFT JOIN `state_cities` ON `delivery_locations`.`city_id` = `state_cities`.`id`
LEFT JOIN `states` ON `delivery_locations`.`state_id` = `states`.`id`
WHERE `delivery_locations`.`deleted_at` IS NULL
ORDER BY `state_name` ASC, `city_name` ASC